<?xml version="1.0" encoding="ISO-8859-1" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
       "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
<head>
<title>ProgrammierABC</title>
<link href="../css/print.css" type="text/css" rel="stylesheet"/>
<link href="../css/ProgABC_JavaScript_StyleDefinition.css" type="text/css" rel="stylesheet"/>

<script src="../scripts/ProgABC_UI.js" type="text/javascript"></script>
<script src="../scripts/ProgABC_HLCode.js" type="text/javascript"></script>
<script src="../scripts/ProgABC_JavaScript_SyntaxDefinition.js" type="text/javascript"></script>

<script type="text/javascript">
window.onload = function init() {
    try {
        ProgABC_highlightCode();
    }
    catch(e)
    {
        alert(e);
    }
    window.print();
}
</script>
</head>
<body>

<h1 style="background-color:#7690BA;">Schleifen</h1>
<h2>Einleitung</h2>
<p>Computer sind unglaublich praktisch, wenn es darum geht, immer die gleiche Aufgabe xmal hintereinander zu wiederholen.
Weil solche Aufgaben sehr oft programmiert werden, gibt es daf&uuml;r besondere Kontrollstrukturen, so genannte Schleifen.
</p>
<p>
In diesem Kapitel lernst du die drei Kontrollstrukturen <code>while</code>, <code>do while</code> und <code>for</code> kennen.
Du lernst auch, warum Endlosschleifen deinen Computer blockieren und wie du damit umgehen kannst.
</p>
<p>Inhalt:<br />
<a href="Schleifen_3.html" class="nextlink">while</a><br />
<a href="Schleifen_4.html" class="nextlink">do while</a><br />
<a href="Schleifen_5.html" class="nextlink">for</a><br />
<a href="Schleifen_6.html" class="nextlink">Endlosschleifen</a><br />
</p>

<h2>Allgemeiner Aufbau von Schleifen</h2>
<p>Jede Schleife ist nach dem selben Grundprinzip aufgebaut:<br />
Sie wiederholt einen Codeblock (den "Schleifenk&ouml;rper") solange, wie eine bestimmte Bedingung erf&uuml;llt ist.
</p>
<p>
Im Kapitel <a href="Programm_4.html" class="intlink">Programmieren</a> hast du bereits eine solche Schleife kennengelernt:</p>
<div class="code">1:  Anfang
2:  Orange nehmen
3:  Schalenst&uuml;ck abreissen
4:  3 wiederholen, solange noch Schale vorhanden
5:  Meldung: Orange gesch&auml;lt.
6:  Ende
</div>
<p>Zeile 4 beschreibt eine Schleife mit der Bedingung "solange noch Schale vorhanden" und dem Schleifenk&ouml;rper "Schalenst&uuml;ck abreissen".</p>

<h2>while</h2>
<p>Die while-Schleife f&uuml;hrt den Schleifenk&ouml;rper solange aus, wie die Bedingung erf&uuml;llt ist.</p>
<div class="code">i=0;
while(i&lt;2)
{
	i++;
	output(i);
}
output('Ende');
</div>
<p>Die Bedingung wird zwischen Klammern gleich nach dem Schl&uuml;sselwort <code>while</code> geschrieben. Der Schleifenk&ouml;rper wird danach zwischen zwei geschwungenen Klammern notiert.</p>
<p>Das Programm arbeitet wie folgt:</p>
<ol>
<li>Es speichert den Wert 0 in der Variable i.</li>
<li>Es &uuml;berpr&uuml;ft die Bedingung der while-Schleife. 0 ist kleiner als 2, also wird der Schleifenk&ouml;rper ausgef&uuml;hrt.</li>
<li>Es erh&ouml;ht den Wert der Variable i um 1.</li>
<li>Gibt den Wert von i (im Moment 1) aus. Der Schleifenk&ouml;rper ist hier zu Ende.</li>
<li>Das Programm &uuml;berpr&uuml;ft erneut die Bedingung. 1 ist kleiner als 2, also geht es wieder in der Schleife weiter. i wird um 1 erh&ouml;ht und ausgegeben (2).</li>
<li>Nun wird wieder die Bedingung &uuml;berpr&uuml;ft. 2 ist nicht kleiner als 2, der Schleifenk&ouml;rper wird also nicht ausgef&uuml;hrt.</li>
<li>Das Programm gibt 'Ende' aus.</li>
</ol>
<div class="achtung">
Um Fehler zu vermeiden, sollten alle Variablen, die in der Schleifenbedingung vorkommen, klar definiert sein.<br />
Ist die Bedingung von Anfang an nicht erf&uuml;llt, wird der Schleifenk&ouml;rper nie ausgef&uuml;hrt.
</div>


<h2>do while</h2>
<p>Die do-while-Schleife funktioniert genau so wie die while-Schleife, mit dem einzigen Unterschied, dass sie die Bedingung <i>nach</i> der Ausf&uuml;hrung des Schleifenk&ouml;rpers &uuml;berpr&uuml;ft.</p>
<div class="code">i=0;
do {
    i++;
    output(i);
} while(i&lt;2);
output('Ende');
</div>
<p>Der Schleifenk&ouml;rper wird zwischen geschweiften Klammern gleich nach dem Schl&uuml;sselwort <code>do</code> geschrieben. Darauf folgt das Schl&uuml;sselwort <code>while</code> mit der Bedingung in Klammern. Die ganze Struktur muss mit einem Strichpunkt abgeschlossen werden.</p>

<h2>for-Schleife</h2>
<p>Eine besondere Schleife ist die for-Schleife. Sie &uuml;berpr&uuml;ft nicht nur vor jedem Durchgang eine Bedingung, sondern &auml;ndert auch jedesmal den Wert eines Z&auml;hlers.</p>
<div class="code">for(i=0; i&lt;2; i++)
{
	output(i);
}
output('Ende');
</div>
<p>In der Klammer nach dem Schl&uuml;sselwort <code>for</code> m&uuml;ssen drei Anweisungen gemacht werden:</p>
<ol>
<li>Initialisierung der Z&auml;hlervariable.<br />
Es ist &uuml;blich als Variablennamen f&uuml;r Z&auml;hler 'i' zu verwenden. Der Wert, welcher der Z&auml;hlervariable zugewiesen wird, gilt f&uuml;r den ersten Durchgang.</li>
<li>Die Bedingung.<br />
Normalerweise enth&auml;lt die Bedingung die Z&auml;hlervariable (i). Die Schleife wird solange ausgef&uuml;hrt, wie die Bedinung erf&uuml;llt ist.</li>
<li>Eine &Auml;nderungsoperation f&uuml;r die Z&auml;hlervariable.<br />
Meistens muss die Variable um 1 erh&ouml;ht werden.</li>
</ol>

<h2>Endlosschleifen</h2>
<p>Wenn in einer Schleife die Bedingung auf jeden Fall immer erf&uuml;llt ist, spricht man von einer Endlosschleife. Ger&auml;t ein Programm in eine Endlosschleife, kann es nicht mehr gestoppt werden und bringt im schlimmsten Fall den Computer zum Absturz!<br />
Endlosschleifen entstehen, wenn man nicht versteht, was die Schleife genau macht oder wenn die Bedingung nicht genau durchdacht ist.</p>
<p>Endlosschleifen im CodeLab haben je nach verwendetem Browser unterschiedlich schwerwiegende Auswirkungen.<br />
Unter Umst&auml;nden reagiert der Browser nicht mehr und "friert ein". In diesem Fall muss das Programm &uuml;ber Apfel-Alt-Esc (bei Mac OS X) oder &uuml;ber Ctrl-Alt-Delete (bei Windows) beendet werden.</p>
<p>Beispiel:</p>
<div class="code">i=0;
while(i&lt;10) /*Endlosschleife*/
{
	i++;
	output(i);
	if(i==4)
	{
		i=0;
	}
}
</div>
</body>
</html>